# LessThanTwoBars Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..LessThanTwoBars Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Each reinforcement direction requires at least 2 bars. Please increase the number of bars.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LessThanTwoBars { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LessThanTwoBars As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LessThanTwoBars {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace